<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>EL연산자 사용 예제</title>
</head>
<body>

<h3>\${5+7 } = ${5+7 }</h3> <!-- 더하기 -->
<h3>\${8-3 } = ${8-3 }</h3> <!-- 빼기 -->
<h3>\${6*3 } = ${6*3 }</h3> <!-- 곱하기 -->
<h3>\${9/3} = ${9/3 }</h3> <!-- 나누기 -->
<h3>\${10%3 } = ${10%3 }</h3> <!-- 나머지 -->
<h3>\${10==9 } = ${10==9 }</h3> <!-- ==또는eq 같으면t 다르면f -->
<h3>\${5!=7 } = ${5!=7 }</h3> <!-- !=또는ne 두값이다르면t 그렇지않으면f -->
<h3>\${7<8 } = ${7<8 }</h3> <!-- <또는lt '보다작다' 왼쪽이 오른쪽보다 작으면t -->
<h3>\${8>8 } = ${8>8 }</h3> <!-- >또는gt '보다크다' 왼쪽이 오른쪽보다 크면t -->
<h3>\${15<=9 } = ${15<=9 }</h3> <!-- <=또는le '같거나작다' 왼쪽이 오른쪽보다 같거나 작으면t -->
<h3>\${7>=2 } = ${7>=2 }</h3> <!-- >=또는ge '같거나크다' 왼쪽이 오른쪽보다 같거나 크면t  -->
<h3>\${5+3==8 ? 8:10 } = ${5+3==8 ? 8:10 }</h3>

<!--  
	상단의 \는 escape문자이다. 
	즉, 표현식 앞에 \를 붙이면 해당 표현식 부분은 파싱되지 않고 문자열 자체로 인식된다.
	즉, 해당 문자가 그대로 화면에 출력되는 것이다. 따라서 예제를 실행하면 다음과 같은 결과가 나타난다.
-->
</body>
</html>
